org/wiki.org
#+setupfile:./hugo_setup.org
#+hugo_slug: wiki
#+title: Wiki

Wikis are tree-based tools for representing
hierarchies of information.

This personal wiki is the one I maintain.
Others refer to personal wikis as /Digital Gardens/,
/Brain Dumps/, or /Personal Libraries/.

The source of this wiki can be found at [[https://github.com/jakechv/wiki]].

* Motivation
** Organization
I needed a way to better organize my ideas.
Administering structure to my data was a good way
to do this, and org-mode provides a good facility for this.
Further, the constraints administered by the website motivate
me to better organize my notes as they're visible to the public;
without this structure the notes won't even render properly.
** Accessibility
I'd like my notes to be easily visible to anyone.
It allows me to easily share my thoughts and perspectives with
friends or colleagues.
** Publicity
This portal also enables recruiters or future collaborators to
learn more about me, my skills and my interests. Perhaps I can
build a following, inspire someone, or find an interesting job
opportunity if someone stumbles upon this wiki.
* Design
- tags :: [[file:web_design.org][Web Design]],[[file:design.org][Design]]
The design of this wiki takes after the principles of simple and minimal as discussed.
I introduce additional logic for the multi-pane browsing as I feel that it's more conducive
to consuming information than the typical browser structure and it adds a unique feel to the site.
[[https://github.com/jakchv/cortex][Here]] is the template I use to publish this wiki.
I may consider other templates or alternative views in the future,
and will continue iterating on this design,
but I plan to keep this template around.
* References
I've taken inspiration from several others who maintain wikis.
- [[https://github.com/tommy-mor][Tommy Morriss]] first introduced me to the idea with his personal (private) wiki.
- [[https://jethro.dev][Jethro]] has easily accessible articles and templates that I've made use of to put this together.
- [[file:../people/100_rabbits.org][100 Rabbits]] publish all of their notes and information in a custom wiki framework.
  https://github.com/logseq/logseq is a cool framework that syncs with github
  https://github.com/kormyen/memex
* Further Inspiration
[[https://github.com/frankmcsherry/blog][Frank McSherry's blog]] is maintained entirely by .md files in a journal with a simple markdown index. Git *is* the UI.
https://github.com/jackmcdade/secret-public-journal
https://github.com/HermanMartinus/bearblog
https://github.com/bphenriques/knowledge-base elisp wiki
https://github.com/nikitavoloboev/knowledge
https://github.com/karlicoss/beepb00p
https://github.com/bennetthardwick/website
https://github.com/nikitavoloboev/knowledge -- i *love* the idea of visualizing the ralations of the notes as well as his rationale
https://github.com/aceyoung9/garden
https://github.com/binyamin/eleventy-garden

* Frameworks
[[https://github.com/buckket/twtxt][txtxt is a CLI microblogging service for 'hackers']]
https://codeberg.org/Valenoern/bopwiki microwiki
https://blot.im/ blog platform with no interface
* Notes
https://www.youtube.com/watch?v=nXgqnYVAzKk&app=desktop note citation system for vim and pandoc
https://blog.griffin.sh/2020/06/05/how-we-write/ improving language for blogging
https://jlelse.blog/posts/wiki-approach/ cool wiki approach :: find the best method for me ! I think writing a blog post is the best way to help me organize my thoughts, i should get that infrastructure up. nextcloud notes is also a good option, but i do have to set up a nextcloud server to handle that
https://dpitt.me/blog/2020/03/zettelkasten/
[[https://obsidian.md/][obsidian md knowledge base]]
[[https://www.thebrain.com/][The Brain]] is a digital memory solution written and maintained by the brother of Acronym's founder, Errolson,for many years. It's not well known in the technology space, but it's popular with creatives and researchers who often don't intersect with the field.

* organization
https://todaytakeseverything.wordpress.com/2016/09/29/the-bullet-journal-bulletproof/
doing things once a day and putting them in a bullet journal or something
https://www.reddit.com/r/philosophy/comments/1vn6uk/thoughts_on_the_meditations_by_marcus_aurelius/
https://www.veilance.com/gb/en/shop/mens/isogon-mx-jacket
